const pairReviews = [
  {
    good: `우성님 첫 페어인데 되게 열심히 해줬던 거 같아요. 
    드라이버랑 네비게이터를 나눴지만 서로 역할 분담을 바꿔가면서 했네요. 
    정규수업 외 시간에도 열정적으로 문제를 같이 풀게 되어서 안심도 되고 그랬던 거 같아요. 
    많은 에너지를 얻어 갑니다`,
    improvement: `저희 둘 다 아직 첫시작이다보니까 뭔가 문제에 대한 이해도가 살짝 아쉬웠던 거 같아요.. 
    너무 헤맸던 걸 생각하면? 좀 더 기초를 보완해서 문제에 너무 어렵게 말고 쉽게 접근을 하도록 해요`,
    pair: "2020.12.15 코드스테이츠 IM27 신혜정님",
    data_filter: "slide01"
  },
  {
    good: `침착하게 생각하시며 문제가 생겼을 때 적극적으로 해결하려는
    모습을 배우고 싶었습니다! 함께 페어를 진행하다 저희가 모르는
    점에 부딪혔을 때 바로바로 구글에 검색하거나 정리해 놓으신
    내용을 보며 해결하려는 모습이 인상 깊었습니다. 평소에 정리를
    잘해 놓으신다고 느껴 본받고 싶었습니다! 그리고 제가 이해가 안
    가는 똑같은 부분을 몇 번 물어보았을 때도 귀찮으실 수 있는데
    계속 다른 예시를 들어 설명해주셔서 감사했습니다! 또한 목업부터
    함께 페어를 진행한 시간이 길었는데 정규 시간 외에도 계속 함께
    열정적으로 달릴 수 있어서 좋았습니다! 지칠 수 있는
    시간이었는데 지친 모습도 없이 항상 밝은 분위기로 유지해주셔서
    너무 감사했습니다! 저희 남은 트위틀러도 파이팅해요..!`,
    improvement: `배운 것을 잘 정리하시는 것 같아서 코드 작성 외에 git
    사용법같이 자주 사용하지 않으면 잊어버릴 수 있는 것들은 꾸준히
    사용해보시면 좋을 것 같습니다! :D`,
    pair: "2020.12.30 코드스테이츠 IM27 김민정님",
    data_filter: "slide02"
  },
  {
    good: `한 문제를 두고 오랜시간동안 고민하고, 레퍼런스를 안보려고
    하시는 부분이 대단하다고 느껴졌습니다. 그리고 제가 드라이버를
    수행할 때, 풀어나가는 과정을 지켜보시면서 중간중간에 왜 그렇게
    풀었는지에 대해 질문을 하셨는데.. 그럴때마다 다시 생각해보고,
    대답을 하는 과정이 개인적으로 학습에 정말 도움이 많이 됐다고
    생각합니다. 어려운 재귀를 배울때 우성님이랑 페어해서 참
    다행이라고 생각했습니다. :)`,
    improvement: `아마 제 개선할 점과 비슷하지 않을까 생각합니다 :) 소프트스킬은
    이미 충분하시니, 이제 이머시브로 가서 함께 하드스킬을
    키웁시다!!`,
    pair: "2021.01.07 코드스테이츠 IM27 이연주님",
    data_filter: "slide03"
  },
  {
    good: `페어의 상태에 맞춰서 대응을 해주신점이 좋았습니다. 이전에 다른
    언어지만 프로그램에 익숙한 저나 다시 수강하시는 우성님이나
    문제 풀이에 대해서는 서로 어려움을 느끼지 않았지만
    자바스크립트라는 언어가 생소한 저에게 먼저 접하게 하셨고
    언어적으로 미숙한 부분 을 도와 주시는 등 간접적인 도움을
    주셨습니다.`,
    improvement: `개선점을 확인 할정도로 문제풀이에 있어서 고됨을 느끼지 못하여
    이에 대해서 적절한 답을 잘 알지 못하겠습니다.`,
    pair: "2021.01.20 코드스테이츠 IM28 공인택님",
    data_filter: "slide04"
  },
  {
    good: `페어 시간에 주어진 과제를 다 끝나고 나서 남은 시간에도 다른 할 일을 찾으시는 게 인상적이었습니다. 
    성실하시고 개발에 열정이 넘치는 모습이 보기 좋습니다.`,
    improvement: `개선할 점은 없고 스프린트가 짧아서 아쉬웠습니다. 
    다음에 또 페어할 기회가 온다면 좋겠네요.`,
    pair: "2021.02.23 코드스테이츠 IM28 지주현님",
    data_filter: "slide05"
  },
  {
    good: `우성님!! 페어로 아는 분을 만나서 너무 반가웠어요. 이미 아는
    분이라서 그런지 페어 내내 화기애애한 분위기 속에서 진행을 할
    수 있었단것 같답니다. 페어로 처음 뵌게 아니라서 리뷰가
    객관적이지 못할 수 있지만 감안해서 봐주셨으면 해요! 저는
    페어를 하면서 우성님이 먼저 어떻게 해볼까요? 어떻게
    생각하세요? 라고 물어봐주시는게 너무 좋았어요. 확실히 협업을
    많이 해보신 분이라서 그런지 먼저 생각하고 앞서나가실 수도
    있었는데 제가 의견을 잘 못 말하는 성격이라 그런지 그렇게 먼저
    물어봐주시니까 오히려 편하게 말 할 수 있었던 것 같아요. 의견을
    잘 못말하는 것 뿐이지 생각은 다 하거든요ㅋㅋㅋㅋ 감사했어요.
    그리고 우성님은 진심어린 칭찬을 잘 하신다고 생각했어요. 그렇게
    격려 받으면서 페어로 하다 보니까 더 신나서 과제를 했던 것
    같아요! 정말정말 감사했습니다! 주말마다 스터디에서 또 봐요~~`,
    improvement: `음... 개선할 점 이라기 보다는 스터디에서 분위기를 주도하시고
    zoom 시간에 결과물을 발표도 하시고 하셔서 저는 우성님이 굉장히
    활발하신 분이라고 생각했었어요. 하지만 이번에 페어로 대화를
    하다 보니 생각보다 소극적인 부분도 있구나 하고 새로운 면을
    알게 되었답니다. 저는 사람들 많으면 말을 못 하는데 우성님은
    반대인가보다 라고 생각했어요ㅋㅋㅋㅋ 우리 둘 다
    코드스테이츠에서 처음 코딩을 배우는 계기인 시간일 뿐이니까
    서로 서로의 삽질을 보면서 쟤도 똑같구나... 생각하면서
    힘내자구요!! 아마 제가 더 심하게 삽질 할 것 같기는 하지만요!!!
    저희가 가진 많은 고민들이 하반기쯔음에는 많이 해결되었으면
    좋겠네요. 일주일에 한번씩은 스터디에서 보긴 하겠지만 그래도
    응원해요 화이팅이에요!!!`,
    pair: "2021.02.25 코드스테이츠 IM28 안유원님",
    data_filter: "slide06"
  },
  {
    good: `제가 문제가 안풀려서 좌절하고 있을 때 긍정적으로 저를 붙잡고 
    같이 끌고 문제를 해결해주셨습니다.
    의견을 잘 말씀해주셔서 제가 헤매고 있는 부분을 효자손처럼 시원하게 긁어주셨습니다. 
    제가 아이디어를 열심히 내면 부정적인 반응 보다 긍정적인 반응이 많아서 
    배려심이 많으신 분이라는 것을 느꼈고 감사했습니다!`,
    improvement: `저는 정말 좋았습니다. 하지만 굳이 말하자면 의견을 말해주실 때 우성님이 해보고 싶으신 것을  
    조금 더 강력하게 어필해주시면 더할나위없이 좋을 것 같습니다!`,
    pair: "2021.03.03 코드스테이츠 IM28 김민성님",
    data_filter: "slide07"
  },
  {
    good: `이해도 빠르시고 헤매는 부분이 생겼을 때 제가 조금만 힌트를
    주면 바로 답을 찾으셔서 스프린트를 빠르게 진행할 수
    있었습니다. 막히는 부분은 같이 고민하면서 왜 이렇게 되는지
    토론하고 함께 해결하는 과정이 즐거웠습니다. 오랜만에 잘맞는
    페어분을 만나서 페어시간을 더 알차게 사용할 수 있었던 것
    같습니다. 이야기도 잘 통해서 스프린트 이외의 주제에 대해서
    많은 대화를 나누었습니다. 이야기하다보니 신나서 저도 모르게
    이것저것 많이 이야기한거같은데.. 혹시 민폐가 아니었는지 조금
    걱정이긴하네요ㅠㅠ 우성님 덕분에 앞으로 진행할 프로젝트에
    대해서 깊은 생각을 해볼 수 있게 되었습니다. 그때가면 어떻게든
    되겠지, 라고 막연하게 생각했었는데 그게 아니라 지금부터라도
    조금씩 미리 고민해보는게 좋을 거 같다는 우성님의 말을 듣고
    현재 저의 모습(오늘 수업 마무리하는 것에 만족)에 대해
    반성해보고 앞으로 어떻게 해야할지 생각해보게 되었습니다. 짧은
    페어 기간이었지만 잘 맞는거같아 개인적으로 만약 기회가 된다면
    프로젝트도 같이 진행해보고 싶은데 우성님 생각은 어떨지
    궁금하네요ㅎㅎ 여러모로 스프린트 진행에서도 외적인 부분에서도
    많은 도움을 받았습니다~!`,
    improvement: `스프린트를 해결하고 테스트 통과까지 완료했었는데 이후 남은
    시간에 같이 처음부터 리액트+리덕스 코드를 작성해보는 시간을
    가져보았으면 좋았을거같다는 생각이 문득 들었습니다. 이미
    잘하시지만 나중에 더 내것으로 만들기위해 리액트+리덕스를
    활용하여 간단한 토이 프로젝트를 진행해보는 것도 좋을 것
    같습니다. 이틀동안 수고많으셨습니다. 감사합니다. 남은 시간도
    함께 달려서 원하는 개발자가 되어봅시다. 화이팅입니다!!`,
    pair: "2021.04.08 코드스테이츠 IM28 정송이님",
    data_filter: "slide08"
  },
  {
    good: `면접을 보실때 어떤 개념에 관해 간략하게 깔끔하게 말하시고
    -알고 있습니다 같은 끝맺음이 아닌 -입니다 라는 끝맺음을 통해
    이 분이 이 개념에 관해 잘 알고 있구나 라는 느낌을 받았고
    꼬리물기 질문에도 답변을 잘 해주시고 모르는 개념이 나왔을 때도
    당황하시지 않고 잘 답변해주시는 모습들이 좋았습니다.`,
    improvement: `아쉬운 부분은 없었고 면접을 많이 준비 하셨고 공부도 많이
    하셨다는 느낌을 받았습니다. 면접관 역할을 해주실때도 면접자를
    배려하시는 모습들이 좋았고 항상 겸손한 태도를 유지하며
    임해주시는것이 인상 깊었습니다.`,
    pair: "2021.08.12 네이버 특별 심화반 2기 오우영님",
    data_filter: "slide09"
  },
  {
    good: `우선적으로 질문에 대한 암기가 아니라 이해를 하고 있는 것
    같았습니다. 그래서 자신감이 돋보였던 것 같아요 ㅎㅎ 또한
    긴장을 해서 급하게 말할 수도 있었던 부분들이 없었던 것 같아요
    ! 오히려 침착하게 말씀하시려고 노력하는 모습이 보였고 쉽게
    설명해주시려고 하는 모습도 보였습니다 :) 그러한 태도를 많이
    보고 배웠던 것 같습니다 앞으로도 잘 부탁드릴께여 ㅎㅎ
    감사합니다 :)`,
    improvement: `어떠한 질문에 대해 생각하실 때를 제외하고서는 카메라를 보면서
    말씀하시면 100%가 될 것 같아요 !! 정말 제가 면접관이라고
    생각했을 때 이 사람이 나랑 눈을 마주치면서 얘기를 한다면 더
    좋은 인상을 남길 수 있을 것 같습니다 ~ (단점이 생각 안나서
    이런 얘기라도 하면 좋을 것 같아서 적어봐요 ,,, ) 배울 게 너무
    많았던 시간이였습니다 !! 감사합니다 !`,
    pair: "2021.08.13 네이버 특별 심화반 2기 성석민님",
    data_filter: "slide10"
  },
  {
    good: `역시나 우성님은 에이스네여 ㅎㅎ 질문에 대한 원하는 답만
    말씀해주셨어여 !! 우성님을 보고 동기부여를 했습니다~ (엄청난
    칭찬인 거 아시져 ?) 정말 이론적인 부분은 공부하기 싫었는데 ,,
    멋있다고 느껴졌습니다 ㅎㅎ 꼬리질문에 대한 대답도 너무
    완벽했고 준비를 정말 많이 하신 것 같아서 좋았습니다 :)`,
    improvement: `죄송해요,, 아쉬운 점을 말씀드려야하는데 정말 생각이 나질
    않습니다.. 앞으로도 좋은 모습 기대하겠습니다 :) 감사합니다
    ㅎㅎ`,
    pair: "2021.08.27 네이버 특별 심화반 2기 성석민님",
    data_filter: "slide11"
  }
];

export { pairReviews }